set target_library [list ~/training/sky130RTLDesignAndSynthesisWorkshop/DC_WORKSHOP/lib/sky130_fd_sc_hd__tt_025C_1v80.db ~/training/sky130RTLDesignAndSynthesisWorkshop/DC_WORKSHOP/lib/avsdpll.db ~/training/sky130RTLDesignAndSynthesisWorkshop/DC_WORKSHOP/lib/avsddac.db ]
set link_library [list  ~/training/sky130RTLDesignAndSynthesisWorkshop/DC_WORKSHOP/lib/sky130_fd_sc_hd__tt_025C_1v80.db ~/training/sky130RTLDesignAndSynthesisWorkshop/DC_WORKSHOP/lib/avsdpll.db ~/training/sky130RTLDesignAndSynthesisWorkshop/DC_WORKSHOP/lib/avsddac.db ] 
set symbol_library ""

read_file -format verilog {/nfs/site/disks/png_mip_gen6p9ddr_0042/chiannio/trainning/day20/./VSDBabySoC/src/module/vsdbabysoc.v /nfs/site/disks/png_mip_gen6p9ddr_0042/chiannio/trainning/day20/./VSDBabySoC/src/gls_model/primitives.v /nfs/site/disks/png_mip_gen6p9ddr_0042/chiannio/trainning/day20/./VSDBabySoC/src/gls_model/sky130_fd_sc_hd.v }
read_verilog /nfs/site/disks/png_mip_gen6p9ddr_0042/chiannio/trainning/day20/./VSDBabySoC_ICC2/rvmyth.v
read_verilog /nfs/site/disks/png_mip_gen6p9ddr_0042/chiannio/trainning/day20/./VSDBabySoC_ICC2/clk_gate.v

read_lib /nfs/site/disks/png_mip_gen6p9ddr_0042/chiannio/trainning/./rvmyth/avsdpll.lib
#read_lib /nfs/site/disks/png_mip_gen6p9ddr_0042/chiannio/trainning/day20/VSDBabySoC/src/lib/avsdpll.lib
read_lib /nfs/site/disks/png_mip_gen6p9ddr_0042/chiannio/trainning/day20/VSDBabySoC/src/lib/avsddac.lib

analyze -library WORK -format verilog {/nfs/site/disks/png_mip_gen6p9ddr_0042/chiannio/trainning/day20/./VSDBabySoC/src/module/vsdbabysoc.v}
elaborate vsdbabysoc -architecture verilog -library WORK
#analyze {}

set_units -time ns
create_clock [get_pins {pll/CLK}] -name clk -period 10
set_max_area 8000;
set_max_fanout 5 vsdbabysoc;
set_max_transition 10 vsdbabysoc
#set_min_delay -max 10 -clock[get_clk clk] [get_ports OUT]
set_max_delay 10 -from dac/OUT -to [get_ports OUT]


#set_input_delay[expr 0.34][all_inputs]



set_clock_latency -source 2 [get_clocks clk];
set_clock_latency 1 [get_clocks clk];
set_clock_uncertainty -setup 0.5 [get_clocks clk];
set_clock_uncertainty -hold 0.5 [get_clocks clk];

set_input_delay -max 4 -clock [get_clocks clk] [get_ports VCO_IN];
set_input_delay -max 4 -clock [get_clocks clk] [get_ports ENb_CP];
set_input_delay -min 1 -clock [get_clocks clk] [get_ports VCO_IN];
set_input_delay -min 1 -clock [get_clocks clk] [get_ports ENb_CP];

set_input_transition -max 0.4 [get_ports ENb_CP];
set_input_transition -max 0.4 [get_ports VCO_IN];
set_input_transition -min 0.1 [get_ports ENb_CP];
set_input_transition -min 0.1 [get_ports VCO_IN];

set_load -max 0.5 [get_ports OUT];
set_load -min 0.5 [get_ports OUT];

#check_design

compile_ultra

file mkdir report
write -hierarchy -format verilog -output /nfs/site/disks/png_mip_gen6p9ddr_0042/chiannio/trainning/day20/report/nvsdbabysoc_gtlvl.v
write_sdc -nosplit -version 2.0 /nfs/site/disks/png_mip_gen6p9ddr_0042/chiannio/trainning/day20/report/nvsdbabysoc.sdc
report_area -hierarchy > /nfs/site/disks/png_mip_gen6p9ddr_0042/chiannio/trainning/day20/report/nvsdbabysoc.area
report_timing > /nfs/site/disks/png_mip_gen6p9ddr_0042/chiannio/trainning/day20/report/nvsdbabysoc.timing
report_power -hierarchy > /nfs/site/disks/png_mip_gen6p9ddr_0042/chiannio/trainning/day20/report/nvsdbabysoc.power

gui_start
